[Information]
; (Latest Translator, First Translator, Second Translator ...)
TRANSLATORS=GXUP320
VERSION=1.0.0

[Language]
LANGUAGE=English(United States)
CHARACTER_CODE=Unicode (UTF-16, LE, w/ BOM)
; Locale ID : http://msdn.microsoft.com/en-us/library/ms912047(WinEmbedded.10).aspx
LOCALE_ID=1033

[SystemMenu]
SYSMENU_ABOUTBOX=About WindowsTools(&A)...

[Menu]
MENU_FILE=File
MENU_FILE_EXIT=Exit

MENU_WINDOW=Window
MENU_WINDOW_REFRESH_WINDOW_TREE=Refresh window tree
MENU_WINDOW_HIGHLIGHT=Highlight
MENU_WINDOW_SEND_MESSAGE=Send message
MENU_WINDOW_CONTROL_WINDOW=Control window
MENU_WINDOW_GENERATE_FIND_CODE=Generate find code
MENU_WINDOW_GENERATE_FIND_CODE_FAST=Generate find code (fast)

MENU_LANGUAGE=Language

[Title]
TITLE_WINDOW_TOOLS=Windows tools
TITLE_ABOUT=About Window tools
TITLE_SEND_MESSAGE=Send message
TITLE_GENERATE_FIND_CODE=Generate find code
TITLE_CONTROL=Control window
TITLE_WINDOW_STYLE=Window style

[About]
ABOUT_VERSION=Window tools, Version [VERSION]
ABOUT_COPYRIGHT=Copyright (C) GXUP320

[Dialog]
DIALOG_WINDOW_HANDLE_DEC=Window handle DEC:
DIALOG_WINDOW_HANDLE_HEX=Window handle HEX:
DIALOG_PARENT_WINDOW_HANDLE=Parent window handle:
DIALOG_WINDOW_TEXT=Window text:
DIALOG_WINDOW_CLASS_NAMEWindow class name:
DIALOG_WINDOW_CONTROL_ID=Window control ID:
DIALOG_THREAD_HANDLE=Thread handle:
DIALOG_PROCESS_ID=Process ID:
DIALOG_PARENT_PROCESS_ID=Parent process ID:
DIALOG_PROCESS_PATH=Process path:
DIALOG_PROCESS_NAME=Process name:
DIALOG_WINDOW_RECT=Window RECT
DIALOG_WINDOW_RECT_LEFT=Left:
DIALOG_WINDOW_RECT_RIGHT=Right:
DIALOG_WINDOW_RECT_TOP=Top:
DIALOG_WINDOW_RECT_BOTTOM=Bottom:
DIALOG_WINDOW_RELATIVE_POSITION=Window relative position
DIALOG_WINDOW_RELATIVE_POSITION_LEFT=Left:
DIALOG_WINDOW_RELATIVE_POSITION_TOP=Top:
DIALOG_WIDTH=Width:
DIALOG_HIGTH=High:
DIALOG_SPECIFIES_SHOWN=Specifies shown:
DIALOG_REFRESH=Refresh
DIALOG_SHOW_HIDE_WINDOWS=Show hide windows
DIALOG_SHOW_HIDE_CHILD_WINDOWS=Show hide child windows
DIALOG_READ_FILE_ICON=Read file icon
DIALOG_REFRESH_WINDOWS_TREE=Refresh windows tree
DIALOG_TREE_LOADING=Loading...
DIALOG_WINDOW_STYLE=Style:
DIALOG_WINDOW_STYLE_EX=Extended style:
DIALOG_WINDOW_STYLE_ADVANCED=Advanced
DIALOG_CHECK_DISABLED=Disabled
CHECK_GET_HIDE_WINDOW=Get hide window

[CONTROL]
CONTROL_WINDOW_HANDLE=Window handle:
CONTROL_TAB_COMMON=Common
CONTROL_TAB_EDIT=Edit

[SENDMESSAGE]
WINDOW_HANDLE=Window handle:
WINDOW_CLASS_NAME=Window class name:
WINDOW_TYPE=Window type:
MESSAGE=Message:
SEND=Send

[COMMON]
ERROR=ERROR:
ERROR0=Window is destroyed or its owning thread dies.
WAITING=Waiting...
RETURNVALUE=Return value: [VALUE]

[WM_NULL]
Static0=Performs no operation. An application sends the WM_NULL message if it wants to post a message that the recipient window will ignore.

[WM_MOVE]
Static0=Sent after a window has been moved.
Static1=X:
Static2=Y:

[WM_SIZE]
Static0=Sent to a window after its size has changed.
Static1=Width:
Static2=High:
Static3=Type of resizing:
ComboBox0_0=SIZE_RESTORED
ComboBox0_1=SIZE_MINIMIZED
ComboBox0_2=SIZE_MAXIMIZED
ComboBox0_3=SIZE_MAXSHOW
ComboBox0_4=SIZE_MAXHIDE

[WM_SETFOCUS]
Static0=Sent to a window after it has gained the keyboard focus.
Static1=Window handle:
Static2=A handle to the window that has lost the keyboard focus.

[WM_KILLFOCUS]
Static0=Sent to a window immediately before it loses the keyboard focus.
Static1=Window handle:
Static2=A handle to the window that receives the keyboard focus.

[WM_SETTEXT]
Static0=Sets the text of a window.
Static1=Window text:

[WM_GETTEXT]
Static0=Gets the text of a window.
Static1=Window text:

[WM_GETTEXTLENGTH]
Static0=Determines the length, in characters, of the text associated with a window.
TEXTLENGTH=Text length: [VALUE]

[WM_PAINT]
Static0=The WM_PAINT message is sent when the system or another application makes a request to paint a portion of an application's window. The message is sent when the UpdateWindow or RedrawWindow function is called, or by the DispatchMessage function when the application obtains a WM_PAINT message by using the GetMessage or PeekMessage function.

[WM_CLOSE]
Static0=Sent as a signal that a window or an application should terminate.